system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.000001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;
maxAlphaCo      5;
maxDeltaT       0.01;

libs            ("libwaves.so");

functions
{
    surfaces
    {
        type            surfaces;
        libs            ("libsampling.so");

        writeControl    adjustableRunTime;
        writeInterval   0.01;

        startTime       10;

        surfaceFormat   vtk;
        writeFormat     binary;
        fields          (p_rgh U);

        interpolationScheme cellPoint;

        surfaces
        (
            interface
            {
                type            isoSurface;
                isoField        alpha.water;
                isoValue        0.5;
                interpolate     true;
            }
        );
    }
        
    forces
    {
        type            forces;
        libs            ("libforces.so");

        patches
        (
            wall
        );

        log             yes;
        CofR            (0 0 0);
        binData
        {
            nBin        20;
            direction   (1 0 0);
            cumulative  yes;
        }

        

    }
}
